In [25]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [26]:
indecies = [1,2,3]
names = ['Munirah','Sara','Mashael']

new_series = pd.Series(names, index=indecies)
new_series

1    Munirah
2       Sara
3    Mashael
dtype: object

In [27]:
#OR usinng dictionary 
names_dict= {1:'Munirah', 2:'Sara', 3: 'Mashael'}
new_series2 = pd.Series(names_dict)
new_series2

1    Munirah
2       Sara
3    Mashael
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [28]:
new_series.index = [11,12,13]
new_series

11    Munirah
12       Sara
13    Mashael
dtype: object

## Q3: Retrieve First and second elements.

In [29]:
new_series[0:2]

11    Munirah
12       Sara
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [30]:
#add duplicates
new_series = new_series.append(pd.Series({14:'Munirah',15:'Sara'}))
new_series

C:\Users\Maryam\AppData\Local\Temp\ipykernel_14004\3699587134.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_series = new_series.append(pd.Series({14:'Munirah',15:'Sara'}))

11    Munirah
12       Sara
13    Mashael
14    Munirah
15       Sara
dtype: object

In [31]:
new_series = new_series.drop_duplicates()
new_series

11    Munirah
12       Sara
13    Mashael
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [34]:
students_data = {
    
    'ID':[1,2,3,4,5,6],
    'Name':['Sami','Munirah','Saad','Lama','Waleed','Sara']
} 
students = pd.DataFrame(students_data,columns=['ID','Name'])
students

   ID     Name
0   1     Sami
1   2  Munirah
2   3     Saad
3   4     Lama
4   5   Waleed
5   6     Sara

## Q6: Read educ_figdp_1_Data.csv file

In [36]:
educ_data = pd.read_csv('educ_figdp_1_Data.csv')
educ_data

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [43]:
#loc labels
# loc = print all rows from 1 to 10 including 10
educ_data.loc[1:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e

In [44]:
# slice  = print all rows from 1 to 10 execluding 10
educ_data[1:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e

In [55]:
#The loc is more useful when dealing with labels indecies
#lets change the indecies in the dataset into label indecies
educ_data = educ_data.set_index("GEO") #set the index of the dataset into column GEO

In [59]:
educ_data.loc['Finland']

,INDIC_ED,Value,Flag and Footnotes
GEO,,,
European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
European Union (28 countries),Total public expenditure on education as % of ...,5.25,e

In [60]:
# unlike the slice which deals with indecies as integers only 
educ_data['Finland']

KeyError: 'Finland'